# Taps
tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "dlr-ts/sumo"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "hudochenkov/sshpass"

# Brews (packages)
brew "exa"
brew "ack"
brew "python@3.9", link: false
brew "glib"
brew "gdk-pixbuf"
brew "gobject-introspection"
brew "librsvg"
brew "webp"
brew "python@3.8"
brew "atk"
brew "autojump"
brew "bash-completion"
brew "bat"
brew "broot"
brew "cask"
brew "ctags"
brew "enchant"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gtk-mac-integration"
brew "gspell"
brew "libarchive"
brew "libgxps", link: true
brew "libsecret"
brew "poppler"
brew "evince"
brew "libass"
brew "sdl2"
brew "ffmpeg"
brew "fzf"
brew "ghi"
brew "git", link: false
brew "gnupg"
brew "htop"
brew "httpie"
brew "hub"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "libxml2"
brew "luarocks"
brew "macvim"
brew "node"
brew "openjdk"
brew "pdf2svg"
brew "pstoedit"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "rcm"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "sdl2_gfx"
brew "shellcheck"
brew "testdisk"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "wget"
brew "yasm"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "dlr-ts/sumo/sumo"
brew "hudochenkov/sshpass/sshpass"

# Casks (Applications)
cask "aliwangwang"
cask "background-music-pre"
cask "docker"
cask "elmedia-player"
cask "eudic"
cask "evernote"
cask "font-fira-code"
cask "github"
cask "grammarly"
cask "inkscape"
cask "iterm2"
cask "jabref"
cask "java"
cask "kindle"
cask "macs-fan-control"
cask "mate-translate"
cask "mendeley-reference-manager"
cask "nightowl"
cask "obsidian"
cask "pycharm"
cask "qq"
cask "sensiblesidebuttons"
cask "skim"
cask "skype"
cask "slack"
cask "sourcetree"
cask "sublime-text"
cask "texstudio"
cask "tickeys"
cask "tripmode"
cask "visual-studio-code"
cask "vlc"
cask "wechat"
cask "whatsapp"
cask "workflowy"
cask "xmind"
cask "xquartz"
cask "zoom"
cask "zotero"
cask "visual-studio-code"
cask "dropbox"