tap "buo/cask-upgrade"
tap "dlr-ts/sumo"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "hudochenkov/sshpass"
# Search tool like grep, but optimized for programmers
brew "ack"
# Core application library for C
brew "glib"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# GNOME accessibility toolkit
brew "atk"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Emacs dependency management
brew "cask"
# Reimplementation of ctags(1)
brew "ctags"
# Spellchecker wrapping library
brew "enchant"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Flexible API to implement spellchecking in GTK+ applications
brew "gspell"
# Multi-format archive and compression library
brew "libarchive"
# GObject based library for handling and rendering XPS documents
brew "libgxps", link: true
# Library for storing/retrieving passwords and other secrets
brew "libsecret"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# GNOME document viewer
brew "evince"
# Modern replacement for 'ls'
brew "exa"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Work on GitHub issues on the command-line
brew "ghi"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Interactive environments for writing and running code
brew "jupyterlab"
# Pager program similar to more
brew "less"
# GNOME XML library
brew "libxml2"
# Package manager for the Lua programming language
brew "luarocks"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# HTTP/2 C Library
brew "nghttp2"
# Development kit for the Java programming language
brew "openjdk"
# PDF converter to SVG
brew "pdf2svg"
# Highly capable, feature-rich programming language
brew "perl"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Convert PostScript and PDF files to editable vector graphics
brew "pstoedit"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Cross-platform application and UI framework
brew "qt"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# RC file (dotfile) management
brew "rcm"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SDL2 graphics drawing primitives and other support functions
brew "sdl2_gfx"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Powerful free data recovery utility
brew "testdisk"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Compiler for the GObject type system
brew "vala"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Modular BSD reimplementation of NASM
brew "yasm"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simulation of Urban MObility
brew "dlr-ts/sumo/sumo"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
brew "hudochenkov/sshpass/sshpass"
# Shopping communication tool
cask "aliwangwang"
# Desktop client for Amazon Music
cask "amazon-music"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# App to build and share containerized applications and microservices
cask "docker"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Desktop automation application
cask "hammerspoon"
# Reference manager to edit, manage and search BibTeX files
cask "jabref"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Select text in any app and translate it
cask "mate-translate"
# Research management tool
cask "mendeley-reference-manager"
# Utility to toggle dark mode
cask "nightowl"
# IDE for professional Python development
cask "pycharm"
# Instant messaging tool
cask "qq"
cask "sensiblesidebuttons"
# PDF reader and note-taking application
cask "skim"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Text editor for code, markup and prose
cask "sublime-text"
# LaTeX editor
cask "texstudio"
# Utility for producing audio feedback when typing
cask "tickeys"
# Control your data usage on slow or expensive networks
cask "tripmode"
# Open-source code editor
cask "visual-studio-code"
# Notetaking tool
cask "workflowy"
# Mind mapping and brainstorming tool
cask "xmind"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "AdGuard for Safari", id: 1440147259
mas "BBEdit", id: 404009241
mas "Bear", id: 1091189122
mas "CollageIt 3 Lite", id: 675540049
mas "com.pearlmountainsoft.CollageIt3Pro", id: 675502824
mas "CopyClip", id: 595191960
mas "Day One", id: 1055511498
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Evernote", id: 406056744
mas "Evernote Web Clipper", id: 1481669779
mas "Fotor Photo Editor", id: 503039729
mas "Grammarly for Safari", id: 1462114288
mas "Helium", id: 1054607607
mas "HiSuite", id: 1232508288
mas "HP Smart", id: 1474276998
mas "Hush", id: 1544743900
mas "Instantane", id: 946685517
mas "Instapaper Save", id: 1481302432
mas "Kindle", id: 405399194
mas "Magnet", id: 441258766
mas "Manico", id: 724472954
mas "Mendeley Web Importer", id: 1577516695
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "NewsGuard", id: 1485417785
mas "Night Eye", id: 1450504903
mas "Paste", id: 967805235
mas "PayPal Honey", id: 1472777122
mas "Picture Collage Maker 3 Lite", id: 715483615
mas "Price.com", id: 1424535163
mas "Push to Kindle", id: 1548529953
mas "Reeder", id: 1529448980
mas "scite", id: 1551820111
mas "Secrets", id: 973049011
mas "Spark", id: 1176895641
mas "Super Agent", id: 1568262835
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "TickTick", id: 966085870
mas "Vimari", id: 1480933944
mas "Wayback Machine", id: 1472432422
mas "WeChat", id: 836500024
mas "WhatsApp", id: 1147396723
mas "穿梭", id: 1345035954
mas "网易有道词典", id: 491854842
